app/Controllers/api/PendingTransactions.php

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE DATE_FORMAT(transactions.date_and_time_filed,'%Y-%m') = '2023-04'
AND `number` = '2'
---
    public function add_transaction(){
        if ($this->request->isAJAX()) {

            $data = array(
                'number'                    => $this->request->getPost('pmas_number'),
                'date_and_time_filed'       =>  date('Y-m-d H:i:s', time()),
                'responsible_section_id'    =>$this->request->getPost('type_of_monitoring_id'),
                'type_of_activity_id'       => $this->request->getPost('type_of_activity_id'),
                'under_type_of_activity_id' => $this->request->getPost('select_under_type_id'),
                'date_and_time'             =>  date("Y/m/d H:i:s", strtotime($this->request->getPost('date_time'))),
                'responsibility_center_id'  =>   $this->request->getPost('responsibility_center_id'),
                'cso_Id'                    => $this->request->getPost('cso_id'),
                'created_by'                => session()->get('user_id'),
                'transaction_status'        => 'pending'
            );


            $array_where = array(

                    'date_and_time_filed'   => date('Y-m', time()),
                    'number'                => $data['number']
            );

            $verify =  $this->TransactionModel->verify_pmas_number($array_where)->countAllResults();